basic_location = "合肥"
wea_db_path = './db_data/weather.db'
trans_month ={"一月":"01月","二月":"02月","三月":"03月","四月":"04月","五月":"05月","六月":"06月",
              "七月":"07月","八月":"08月","九月":"09月","十月":"10月","十一月":"11月","十二月":"12月",
              "1月": "01月", "2月": "02月", "3月": "03月", "4月": "04月", "5月": "05月", "6月": "06月",
              "7月": "07月", "8月": "08月", "9月": "09月"
              }
trans_day ={"一日":"01日","二日":"02日","三日":"03日","四日":"04日","五日":"05日","六日":"06日",
            "七日":"07日","八日":"08日","九日":"09日","十日":"10日","十一日":"11日","十二日":"12日",
            "十三日": "13日", "十四日": "14日", "十五日": "15日", "十六日": "16日", "十七日": "17日", "十八日": "18日",
            "十九日": "19日", "二十日": "20日", "二十一日": "21日", "二十二日": "22日", "二十三日": "23日", "二十四日": "24日",
            "二十五日": "25日", "二十六日": "26日", "二十七日": "27日", "二十八日": "28日", "二十九日": "29日", "三十日": "30日",
            "三十一日": "31日",
            "1日":"01日","2日":"02日","3日":"03日","4日":"04日","5日":"05日","6日":"06日",
            "7日":"07日","8日":"08日","9日":"09日","10日":"10日"
            }

trans_special={"PM2.5":"PM25","臭氧":"O3","二氧化硫":"SO2","一氧化碳":"CO","二氧化氮":"NO2",
                "湿度":"humidty","风向":"wind","风速":"wind_inten","紫外线":"ultra_ray"}