{"backend": "tensorflow", "keras_version": "2.2.2", "config": [{"config": {"mask_value": -1, "name": "masking_1", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 6, 48]}, "class_name": "Masking"}, {"config": {"recurrent_constraint": null, "activation": "tanh", "name": "lstm_1", "stateful": false, "recurrent_activation": "hard_sigmoid", "unroll": false, "units": 32, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.2, "implementation": 1, "go_backwards": false, "bias_constraint": null, "unit_forget_bias": true, "return_state": false, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "recurrent_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_sequences": false, "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "recurrent_dropout": 0.0, "bias_regularizer": null}, "class_name": "LSTM"}, {"config": {"dtype": "float32", "kernel_regularizer": null, "activation": "linear", "name": "dense_1", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "bias_regularizer": null, "batch_input_shape": [null, 32], "units": 18, "use_bias": true, "trainable": true, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential"}